app/Controllers/Barangkeluar.php

INSERT INTO `barangkeluar` (`faktur`, `tglfaktur`, `idpel`, `totalharga`, `jumlahuang`, `sisauang`) VALUES ('2503220001', '2022-03-25', '3', '190000', '', '')
SELECT *
FROM `temp_barangkeluar`
WHERE `detfaktur` = '2503220001'
---
    function simpanPembayaran()
    {
        if ($this->request->isAJAX()) {
            $nofaktur = $this->request->getPost('nofaktur');
            $tglfaktur = $this->request->getPost('tglfaktur');
            $idpelanggan = $this->request->getPost('idpelanggan');
            $totalbayar = str_replace(".", "", $this->request->getPost('totalbayar'));
            $jumlahuang = str_replace(".", "", $this->request->getPost('jumlahuang'));
            $sisauang = str_replace(".", "", $this->request->getPost('sisauang'));

            $modelBarangKeluar = new ModelBarangKeluar();

            //simpan ke table barang keluar
            $modelBarangKeluar->insert([
                'faktur'        => $nofaktur,
                'tglfaktur'     => $tglfaktur,
                'idpel'         => $idpelanggan,
                'totalharga'    => $totalbayar,
                'jumlahuang'    => $jumlahuang,
                'sisauang'      => $sisauang
            ]);

            $modelTemp      = new ModelTempBarangKeluar();
            $dataTemp       = $modelTemp->getWhere(['detfaktur' => $nofaktur]);

INSERT INTO `detail_barangkeluar` (`detbrgkode`, `detfaktur`, `dethargajual`, `detjml`, `detsubtotal`) VALUES ('pb001','2503220001','190000','1','190000')
---
            }

            $modelDetail = new ModelDetailBarangKeluar();
            $modelDetail->insertBatch($fieldDetail);

SELECT *
FROM `barangkeluar`
WHERE `barangkeluar`.`faktur` = '2503220001'
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`pelid` = '1'
---
    public function edit($faktur)
    {
        $modelBarangKeluar = new ModelBarangKeluar();
        $rowData = $modelBarangKeluar->find($faktur);


        $modelPelanggan = new ModelPelanggan();
        $rowPelanggan = $modelPelanggan->find($rowData['idpel']);