app/Controllers/Barangmasuk.php

SELECT *
FROM `temp_barangmasuk`
WHERE `detfaktur` = 'F-002'
INSERT INTO `barangmasuk` (`faktur`, `tglfaktur`, `totalharga`) VALUES ('F-002', '2022-03-26', 99000)
---
    function selesaiTransaksi()
    {
        if ($this->request->isAJAX()) {
            $faktur     = $this->request->getPost('faktur');
            $tglfaktur  = $this->request->getPost('tglfaktur');

            $modelTemp  = new Modeltempbarangmasuk();

            $dataTemp   = $modelTemp->getWhere(['detfaktur' => $faktur]);

            if ($dataTemp->getNumRows() == 0) {
                $json = [
                    'error' => 'Maaf, data item untuk faktur ini belum ada..'
                ];
            } else {
                // exit('Maaf, gagal menghapus data');

                // Simpan ke tabel barang masuk
                $modelBarangMasuk = new Modelbarangmasuk();

                $totalSubTotal = 0;
                foreach ($dataTemp->getResultArray() as $total) :
                    $totalSubTotal += intval($total['detsubtotal']);
                endforeach;

                $modelBarangMasuk->insert([
                    'faktur'        => $faktur,
                    'tglfaktur'     => $tglfaktur,
                    'totalharga'    => $totalSubTotal
                ]);

INSERT INTO `detail_barangmasuk` (`detfaktur`, `detbrgkode`, `dethargamasuk`, `dethargajual`, `detjml`, `detsubtotal`) VALUES ('F-002', '123', '9000', '10', '10', '90000')
---
                // simpan ke detail barang masuk
                $modelDetailBarangMasuk = new Modeldetailbarangmasuk();
                foreach ($dataTemp->getResultArray() as $rowtemp) :
                    $modelDetailBarangMasuk->insert([
                        'detfaktur'         => $rowtemp['detfaktur'],
                        'detbrgkode'        => $rowtemp['detbrgkode'],
                        'dethargamasuk'     => $rowtemp['dethargamasuk'],
                        'dethargajual'      => $rowtemp['dethargajual'],
                        'detjml'            => $rowtemp['detjml'],
                        'detsubtotal'       => $rowtemp['detsubtotal'],
                    ]);

SELECT COUNT(*) AS `numrows`
FROM `barangmasuk`
SELECT *
FROM `barangmasuk`
 LIMIT 10
---
    public function data()
    {

        $tombolcari = $this->request->getPost('tombolcari');

        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            session()->set('cari_faktur', $cari);
            redirect()->to('/barangmasuk/data');
        } else {
            $cari = session()->get('cari_faktur');
        }

        $modelBarangMasuk = new Modelbarangmasuk();

        $totaldata = $cari ? $modelBarangMasuk->tampildata_cari($cari)->countAllResults() : $modelBarangMasuk->countAllResults();

        $dataBarangMasuk = $cari ? $modelBarangMasuk->tampildata_cari($cari)->paginate(10, 'barangmasuk') : $modelBarangMasuk->paginate(10, 'barangmasuk');