app/Models/ModelBarangKeluar.php

SELECT max(faktur) as nofaktur
FROM `barangkeluar`
WHERE `tglfaktur` = '2022-03-24'
---
    public function noFaktur($tanggalSekarang)
    {
        return $this->table('barangkeluar')->select('max(faktur) as nofaktur')->where('tglfaktur', $tanggalSekarang)->get();