app/Models/Modelbarang.php

    public function tampildata()
    {
        return $this->table('barang')->join('kategori', 'brgkatid=katid')->join('satuan', 'brgsatid=satid')->get();
---
SELECT *
FROM `barang`
JOIN `kategori` ON `brgkatid`=`katid`
JOIN `satuan` ON `brgsatid`=`satid`