app/Models/ModelTempBarangKeluar.php

SELECT *
FROM `temp_barangkeluar`
JOIN `barang` ON `detbrgkode`=`brgkode`
WHERE `detfaktur` = '2603220001'
---
    public function tampilDataTemp($nofaktur)
    {
        return $this->table('temp_barangkeluar')->join('barang', 'detbrgkode=brgkode')->where('detfaktur', $nofaktur)->get();