app/Models/Modelbarangmasuk.php

    public function cekFaktur($faktur)
    {
        return $this->table('barangmasuk')->getWhere([
            'sha1(faktur)' => $faktur
        ]);
---
SELECT *
FROM `barangmasuk`
WHERE sha1(faktur) = 'ddfe163345d338193ac2bdc183f8e9dcff904b43'