app/Models/Modeldetailbarangmasuk.php

    public function dataDetail($faktur)
    {
        return $this->table('detail_barangmasuk')->join('barang', 'brgkode=detbrgkode')->where('detfaktur', $faktur)->get();
---
SELECT *
FROM `detail_barangmasuk`
JOIN `barang` ON `brgkode`=`detbrgkode`
WHERE `detfaktur` = '4'

    public function ambilTotalHarga($faktur)
    {
        $query = $this->table('detail_barangmasuk')->getWhere([
            'detfaktur' => $faktur
        ]);
---
SELECT *
FROM `detail_barangmasuk`
WHERE `detfaktur` = '4'

    public function ambilDetailBerdasarkanID($iddetail)
    {
        return $this->table('detail_barangmasuk')->join('barang', 'brgkode=detbrgkode')->where('iddetail', $iddetail)->get();
---
SELECT *
FROM `detail_barangmasuk`
JOIN `barang` ON `brgkode`=`detbrgkode`
WHERE `iddetail` = '31'