app/Models/Modeltempbarangmasuk.php

    public function tampilDataTemp($faktur)
    {
        return $this->table('temp_barangmasuk')->join('barang', 'brgkode=detbrgkode')->where(['detfaktur' => $faktur])->get();
---
SELECT *
FROM `temp_barangmasuk`
JOIN `barang` ON `brgkode`=`detbrgkode`
WHERE `detfaktur` = '11111'