app/Models/ModelDataBarangKeluar.php

SELECT COUNT(*) AS `numrows`
FROM `barangkeluar`
LEFT JOIN `pelanggan` ON `idpel`=`pelid`
---
    public function count_all($tglawal, $tglakhir)
    {
        if ($tglawal == '' && $tglakhir == '') {
            $tbl_storage = $this->db->table($this->table)->join('pelanggan', 'idpel=pelid', 'left');
        } else {
            $tbl_storage = $this->db->table($this->table)->join('pelanggan', 'idpel=pelid', 'left')->where('tglfaktur >=', $tglawal)->where('tglfaktur <=', $tglakhir);
        }

        return $tbl_storage->countAllResults();